/********************************************
<项目名称> main.cpp
<功能> 实现走迷宫游戏
<创建日期>  2017.7.19   无风丶
<项目周期> 1天
<最后修改>2017.7.19
**********************************************/
#include"tool.h"
int main()
{
	char a[8][11]{
		{"1111011111"},
		{"1011001111"},
		{"1001100101"},
		{"1000110001"},
		{"1001100111"},
		{"1011001111"},
		{"1000000001"},
		{"1101111111"}
	};
	Person r1;
	Manp M1(a,8,10);
	while (1)
	{
		M1.Drowp(r1._rPos, r1.p_rPos, r1.P);
		if (r1.Juge())
		{
			M1.Gotoxy(10, 10);
			cout << "WIN!"<<endl;
			cout << r1.getstep() << endl;
			system("pause");
			break;
		}
		r1.direction(a);
		r1.move(a);
		Sleep(400);
	}
	return 0;
}